Enums/ДействияПослеИстеченияВремениЭлектронногоКурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ДействияПослеИстеченияВремениЭлектронногоКурса</Name>
			<Comment>timeLimitAction</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выйти</Name>
					<Comment>exit,no message</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщитьИВыйти</Name>
					<Comment>exit,message</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродолжитьРаботу</Name>
					<Comment>continue,no message</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СообщитьИПродолжитьРаботу</Name>
					<Comment>continue,message</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДействияПослеИстеченияВремениЭлектронногоКурса/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеSCORM(ДействиеПослеИстеченияВремени) Экспорт
	
	Если ЗначениеЗаполнено(ДействиеПослеИстеченияВремени) Тогда
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.СообщитьИВыйти Тогда
			Возврат "exit,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.Выйти Тогда
			Возврат "exit,no message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.СообщитьИПродолжитьРаботу Тогда
			Возврат "continue,message";
		КонецЕсли;
		
		Если ДействиеПослеИстеченияВремени = Перечисления.ДействияПослеИстеченияВремениЭлектронногоКурса.ПродолжитьРаботу Тогда
			Возврат "continue,no message";
		КонецЕсли;
		
	Иначе
		
		Возврат "continue,no message";
		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
